{
  "app_name": "Adobe Acrobat Reader",
  "last_updated": "2025-05-11",
  "vulnerabilities": [
    {
      "cve_id": "CVE-2024-41879",
      "published_date": "2024-08-26",
      "last_modified_date": "2024-09-05",
      "base_score": 7.8,
      "severity": "HIGH",
      "description": "Acrobat Reader versions 127.0.2651.105 and earlier are affected by an out-of-bounds write vulnerability that could result in arbitrary code execution in the context of the current user. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
      "cpe_name": "cpe:2.3:a:adobe:acrobat_reader:-:*:*:*:*:android:*:*"
    },
    {
      "cve_id": "CVE-2024-34130",
      "published_date": "2024-06-13",
      "last_modified_date": "2024-11-21",
      "base_score": 5.5,
      "severity": "MEDIUM",
      "description": "Acrobat Mobile Sign Android versions 24.4.2.33155 and earlier are affected by an Incorrect Authorization vulnerability that could result in a Security feature bypass. An attacker could exploit this vulnerability to access confidential information. Exploitation of this issue does not require user interaction.",
      "cpe_name": "cpe:2.3:a:adobe:acrobat_reader:-:*:*:*:*:android:*:*"
    },
    {
      "cve_id": "CVE-2024-34129",
      "published_date": "2024-06-13",
      "last_modified_date": "2024-11-21",
      "base_score": 7.5,
      "severity": "HIGH",
      "description": "Acrobat Mobile Sign Android versions 24.4.2.33155 and earlier are affected by an Improper Limitation of a Pathname to a Restricted Directory ('Path Traversal') vulnerability that could result in a security feature bypass. An attacker could exploit this vulnerability to access files and directories that are outside the restricted directory and also to overwrite arbitrary files. Exploitation of this issue does not requires user interaction and attack complexity is high.",
      "cpe_name": "cpe:2.3:a:adobe:acrobat_reader:-:*:*:*:*:android:*:*"
    },
    {
      "cve_id": "CVE-2021-40724",
      "published_date": "2021-10-15",
      "last_modified_date": "2024-11-21",
      "base_score": 7.8,
      "severity": "HIGH",
      "description": "Acrobat Reader for Android versions 21.8.0 (and earlier) are affected by a Path traversal vulnerability. An unauthenticated attacker could leverage this vulnerability to achieve arbitrary code execution in the context of the current user. Exploitation of this issue requires user interaction in that a victim must open a malicious file.",
      "cpe_name": "cpe:2.3:a:adobe:acrobat_reader:20.005.30763:*:*:*:classic:*:*:*"
    },
    {
      "cve_id": "CVE-2020-24441",
      "published_date": "2020-11-12",
      "last_modified_date": "2024-11-21",
      "base_score": 5.5,
      "severity": "MEDIUM",
      "description": "Adobe Acrobat Reader for Android version 20.6.2 (and earlier) does not properly restrict access to directories created by the application. This could result in disclosure of sensitive information stored in databases used by the application. Exploitation requires a victim to download and run a malicious application.",
      "cpe_name": "cpe:2.3:a:adobe:acrobat_reader:-:*:*:*:*:android:*:*"
    }
  ]
}