{
  "app_name": "blip",
  "last_updated": "2025-05-18",
  "vulnerabilities": [
    {
      "cve_id": "CVE-2017-11580",
      "published_date": "2019-07-02",
      "last_modified_date": "2024-11-21",
      "base_score": 6.5,
      "severity": "MEDIUM",
      "description": "Blipcare Wifi blood pressure monitor BP700 10.1 devices allow memory corruption that results in Denial of Service. When connected to the \"Blip\" open wireless connection provided by the device, if a large string is sent as a part of the HTTP request in any part of the HTTP headers, the device could become completely unresponsive. Presumably this happens as the memory footprint provided to this device is very small. According to the specs from Rezolt, the Wi-Fi module only has 256k of memory. As a result, an incorrect string copy operation using either memcpy, strcpy, or any of their other variants could result in filling up the memory space allocated to the function executing and this would result in memory corruption. To test the theory, one can modify the demo application provided by the Cypress WICED SDK and introduce an incorrect \"memcpy\" operation and use the compiled application on the evaluation board provided by Cypress semiconductors with exactly the same Wi-Fi SOC. The results were identical where the device would completely stop responding to any of the ping or web requests.",
      "cpe_name": "cpe:2.3:o:blipcare:wi-fi_blood_pressure_monitor_firmware:bp700_10.1:*:*:*:*:*:*:*"
    },
    {
      "cve_id": "CVE-2017-11578",
      "published_date": "2019-07-02",
      "last_modified_date": "2024-11-21",
      "base_score": 5.9,
      "severity": "MEDIUM",
      "description": "It was discovered as a part of the research on IoT devices in the most recent firmware for Blipcare device that the device allows to connect to web management interface on a non-SSL connection using plain text HTTP protocol. The user uses the web management interface of the device to provide the user's Wi-Fi credentials so that the device can connect to it and have Internet access. This device acts as a Wireless Blood pressure monitor and is used to measure blood pressure levels of a person. This allows an attacker who is connected to the Blipcare's device wireless network to easily sniff these values using a MITM attack.",
      "cpe_name": "cpe:2.3:o:blipcare:wi-fi_blood_pressure_monitor_firmware:bp700_10.1:*:*:*:*:*:*:*"
    },
    {
      "cve_id": "CVE-2017-11579",
      "published_date": "2019-07-02",
      "last_modified_date": "2024-11-21",
      "base_score": 7.1,
      "severity": "HIGH",
      "description": "In the most recent firmware for Blipcare, the device provides an open Wireless network called \"Blip\" for communicating with the device. The user connects to this open Wireless network and uses the web management interface of the device to provide the user's Wi-Fi credentials so that the device can connect to it and have Internet access. This device acts as a Wireless Blood pressure monitor and is used to measure blood pressure levels of a person. This allows an attacker who is in vicinity of Wireless signal generated by the Blipcare device to easily sniff the credentials. Also, an attacker can connect to the open wireless network \"Blip\" exposed by the device and modify the HTTP response presented to the user by the device to execute other attacks such as convincing the user to download and execute a malicious binary that would infect a user's computer or mobile device with malware.",
      "cpe_name": "cpe:2.3:o:blipcare:wi-fi_blood_pressure_monitor_firmware:bp700_10.1:*:*:*:*:*:*:*"
    },
    {
      "cve_id": "CVE-2014-4580",
      "published_date": "2014-07-02",
      "last_modified_date": "2025-04-12",
      "base_score": 4.3,
      "severity": "MEDIUM",
      "description": "Cross-site scripting (XSS) vulnerability in blipbot.ajax.php in the WP BlipBot plugin 3.0.9 and earlier for WordPress allows remote attackers to inject arbitrary web script or HTML via the BlipBotID parameter.",
      "cpe_name": "cpe:2.3:a:wp_blipbot_project:wp_blipbot:3.0.9:-:-:*:-:wordpress:*:*"
    }
  ]
}