{
  "app_name": "Cloudflare WARP",
  "last_updated": "2025-05-04",
  "vulnerabilities": [
    {
      "cve_id": "CVE-2023-3747",
      "published_date": "2023-09-07",
      "last_modified_date": "2024-11-21",
      "base_score": 5.5,
      "severity": "MEDIUM",
      "description": "Zero Trust Administrators have the ability to disallow end users from disabling WARP on their devices. Override codes can also be created by the Administrators to allow a device to temporarily be disconnected from WARP, however, due to lack of server side validation, an attacker with local access to the device, could extend the maximum allowed disconnected time of WARP client granted by an override code by changing the date & time on the local device where WARP is running.\n\n",
      "cpe_name": "cpe:2.3:a:cloudflare:warp:6.29:*:*:*:*:android:*:*"
    },
    {
      "cve_id": "CVE-2023-0654",
      "published_date": "2023-08-29",
      "last_modified_date": "2024-11-21",
      "base_score": 3.9,
      "severity": "LOW",
      "description": "Due to a misconfiguration, the WARP Mobile Client (< 6.29) for Android was susceptible to a tapjacking attack. In the event that an attacker built a malicious application and managed to install it on a victim's device, the attacker would be able to trick the user into believing that the app shown on the screen was the WARP client when in reality it was the attacker's app.\n\n",
      "cpe_name": "cpe:2.3:a:cloudflare:warp:-:*:*:*:*:android:*:*"
    },
    {
      "cve_id": "CVE-2023-0238",
      "published_date": "2023-08-29",
      "last_modified_date": "2024-11-21",
      "base_score": 3.9,
      "severity": "LOW",
      "description": "Due to lack of a security policy, the WARP Mobile Client (<=6.29) for Android was susceptible to this vulnerability which allowed a malicious app installed on a victim's device to exploit a peculiarity in an Android function, wherein under certain conditions, the malicious app could dictate the task behaviour of the WARP app.",
      "cpe_name": "cpe:2.3:a:cloudflare:warp:-:*:*:*:*:android:*:*"
    },
    {
      "cve_id": "CVE-2023-2754",
      "published_date": "2023-08-03",
      "last_modified_date": "2024-11-21",
      "base_score": 7.4,
      "severity": "HIGH",
      "description": "The Cloudflare WARP client for Windows assigns loopback IPv4 addresses for the DNS Servers, since WARP acts as local DNS server that performs DNS queries in a secure manner, however, if a user is connected to WARP over an IPv6-capable network, te WARP client did not assign loopback IPv6 addresses but Unique Local Addresses, which under certain conditions could point towards unknown devices in the same local network which enables an Attacker to view DNS queries made by the device.\n\n\n",
      "cpe_name": "cpe:2.3:a:cloudflare:warp:2023.3.381.0:*:*:*:*:windows:*:*"
    },
    {
      "cve_id": "CVE-2023-1862",
      "published_date": "2023-06-20",
      "last_modified_date": "2024-11-21",
      "base_score": 7.3,
      "severity": "HIGH",
      "description": "Cloudflare WARP client for Windows (up to v2023.3.381.0) allowed a malicious actor to remotely access the warp-svc.exe binary due to an insufficient access control policy on an IPC Named Pipe. This would have enabled an attacker to trigger WARP connect and disconnect commands, as well as obtaining network diagnostics and application configuration from the target's device. It is important to note that in order to exploit this, a set of requirements would need to be met, such as the target's device must've been reachable on port 445, allowed authentication with NULL sessions or otherwise having knowledge of the target's credentials.\n\n",
      "cpe_name": "cpe:2.3:a:cloudflare:warp:2023.3.381.0:*:*:*:*:windows:*:*"
    }
  ]
}