{
  "app_name": "Ente",
  "last_updated": "2025-05-05",
  "vulnerabilities": [
    {
      "cve_id": "CVE-2022-2560",
      "published_date": "2023-03-29",
      "last_modified_date": "2025-02-18",
      "base_score": 9.1,
      "severity": "CRITICAL",
      "description": "This vulnerability allows remote attackers to delete arbitrary files on affected installations of EnterpriseDT CompleteFTP 22.1.0 Server. Authentication is not required to exploit this vulnerability. The specific flaw exists within the HttpFile class. The issue results from the lack of proper validation of a user-supplied path prior to using it in file operations. An attacker can leverage this vulnerability to delete files in the context of SYSTEM. Was ZDI-CAN-17481.",
      "cpe_name": "cpe:2.3:a:enterprisedt:completeftp_server:12.1.5:*:*:*:*:*:*:*"
    },
    {
      "cve_id": "CVE-2021-44228",
      "published_date": "2021-12-10",
      "last_modified_date": "2025-04-03",
      "base_score": 10.0,
      "severity": "CRITICAL",
      "description": "Apache Log4j2 2.0-beta9 through 2.15.0 (excluding security releases 2.12.2, 2.12.3, and 2.3.1) JNDI features used in configuration, log messages, and parameters do not protect against attacker controlled LDAP and other JNDI related endpoints. An attacker who can control log messages or log message parameters can execute arbitrary code loaded from LDAP servers when message lookup substitution is enabled. From log4j 2.15.0, this behavior has been disabled by default. From version 2.16.0 (along with 2.12.2, 2.12.3, and 2.3.1), this functionality has been completely removed. Note that this vulnerability is specific to log4j-core and does not affect log4net, log4cxx, or other Apache Logging Services projects.",
      "cpe_name": "cpe:2.3:a:cisco:unified_contact_center_enterprise:12.6\\(2\\):*:*:*:*:*:*:*"
    },
    {
      "cve_id": "CVE-2018-10881",
      "published_date": "2018-07-26",
      "last_modified_date": "2024-11-21",
      "base_score": 4.2,
      "severity": "MEDIUM",
      "description": "A flaw was found in the Linux kernel's ext4 filesystem. A local user can cause an out-of-bound access in ext4_get_group_info function, a denial of service, and a system crash by mounting and operating on a crafted ext4 filesystem image.",
      "cpe_name": "cpe:2.3:o:redhat:enterprise_linux_for_real_time:7.0:*:*:*:*:*:*:*"
    },
    {
      "cve_id": "CVE-2017-15129",
      "published_date": "2018-01-09",
      "last_modified_date": "2024-11-21",
      "base_score": 4.7,
      "severity": "MEDIUM",
      "description": "A use-after-free vulnerability was found in network namespaces code affecting the Linux kernel before 4.14.11. The function get_net_ns_by_id() in net/core/net_namespace.c does not check for the net::count value after it has found a peer network in netns_ids idr, which could lead to double free and memory corruption. This vulnerability could allow an unprivileged local user to induce kernel memory corruption on the system, leading to a crash. Due to the nature of the flaw, privilege escalation cannot be fully ruled out, although it is thought to be unlikely.",
      "cpe_name": "cpe:2.3:o:redhat:enterprise_linux_for_real_time:7.0:*:*:*:*:*:*:*"
    },
    {
      "cve_id": "CVE-2016-4470",
      "published_date": "2016-06-27",
      "last_modified_date": "2025-04-12",
      "base_score": 5.5,
      "severity": "MEDIUM",
      "description": "The key_reject_and_link function in security/keys/key.c in the Linux kernel through 4.6.3 does not ensure that a certain data structure is initialized, which allows local users to cause a denial of service (system crash) via vectors involving a crafted keyctl request2 command.",
      "cpe_name": "cpe:2.3:o:redhat:enterprise_linux_for_real_time:7.0:*:*:*:*:*:*:*"
    }
  ]
}