{
  "app_name": "Home Assistant",
  "last_updated": "2025-05-18",
  "vulnerabilities": [
    {
      "cve_id": "CVE-2023-50715",
      "published_date": "2023-12-15",
      "last_modified_date": "2024-11-21",
      "base_score": 4.3,
      "severity": "MEDIUM",
      "description": "Home Assistant is open source home automation software. Prior to version 2023.12.3, the login page discloses all active user accounts to any unauthenticated browsing request originating on the Local Area Network. Version 2023.12.3 contains a patch for this issue.\n\nWhen starting the Home Assistant 2023.12 release, the login page returns all currently active user accounts to browsing requests from the Local Area Network. Tests showed that this occurs when the request is not authenticated and the request originated locally, meaning on the Home Assistant host local subnet or any other private subnet. The rationale behind this is to make the login more user-friendly and an experience better aligned with other applications that have multiple user-profiles.\n\nHowever, as a result, all accounts are displayed regardless of them having logged in or not and for any device that navigates to the server. This disclosure is mitigated by the fact that it only occurs for requests originating from a LAN address. But note that this applies to the local subnet where Home Assistant resides and to any private subnet that can reach it.",
      "cpe_name": "cpe:2.3:a:home-assistant:home-assistant:2023.9.0:*:*:*:*:*:*:*"
    },
    {
      "cve_id": "CVE-2023-44385",
      "published_date": "2023-10-19",
      "last_modified_date": "2024-11-21",
      "base_score": 8.6,
      "severity": "HIGH",
      "description": "The Home Assistant Companion for iOS and macOS app up to version 2023.4 are vulnerable to Client-Side Request Forgery. Attackers may send malicious links/QRs to victims that, when visited, will make the victim to call arbitrary services in their Home Assistant installation. Combined with this security advisory, may result in full compromise and remote code execution (RCE). Version 2023.7 addresses this issue and all users are advised to upgrade. There are no known workarounds for this vulnerability. This issue is also tracked as GitHub Security Lab (GHSL) Vulnerability Report: GHSL-2023-161.",
      "cpe_name": "cpe:2.3:a:home-assistant:home_assistant_companion:-:*:*:*:*:iphone_os:*:*"
    }
  ]
}