{
  "app_name": "Little Snitch",
  "last_updated": "2025-05-18",
  "vulnerabilities": [
    {
      "cve_id": "CVE-2020-13095",
      "published_date": "2020-06-30",
      "last_modified_date": "2024-11-21",
      "base_score": 8.8,
      "severity": "HIGH",
      "description": "Little Snitch version 4.5.1 and older changed ownership of a directory path controlled by the user. This allowed the user to escalate to root by linking the path to a directory containing code executed by root.",
      "cpe_name": "cpe:2.3:a:obdev:little_snitch:3.6.1:*:*:*:*:*:*:*"
    },
    {
      "cve_id": "CVE-2019-13014",
      "published_date": "2019-08-23",
      "last_modified_date": "2024-11-21",
      "base_score": 5.5,
      "severity": "MEDIUM",
      "description": "Little Snitch versions 4.4.0 fixes a vulnerability in a privileged helper tool. However, the operating system may have made a copy of the privileged helper which is not removed or updated immediately. Computers may therefore still be vulnerable after upgrading to 4.4.0. Version 4.4.1 fixes this issue by removing the operating system's copy during the upgrade.",
      "cpe_name": "cpe:2.3:a:obdev:little_snitch:4.4.0:*:*:*:*:*:*:*"
    },
    {
      "cve_id": "CVE-2017-2675",
      "published_date": "2017-04-06",
      "last_modified_date": "2025-04-20",
      "base_score": 7.8,
      "severity": "HIGH",
      "description": "Little Snitch version 3.0 through 3.7.3 suffer from a local privilege escalation vulnerability in the installer part. The vulnerability is related to the installation of the configuration file \"at.obdev.littlesnitchd.plist\" which gets installed to /Library/LaunchDaemons.",
      "cpe_name": "cpe:2.3:a:obdev:little_snitch:3.6.1:*:*:*:*:*:*:*"
    },
    {
      "cve_id": "CVE-2016-8661",
      "published_date": "2016-11-15",
      "last_modified_date": "2025-04-12",
      "base_score": 8.4,
      "severity": "HIGH",
      "description": "Little Snitch version 3.0 through 3.6.1 suffer from a buffer overflow vulnerability that could be locally exploited which could lead to an escalation of privileges (EoP) and unauthorised ring0 access to the operating system. The buffer overflow is related to insufficient checking of parameters to the \"OSMalloc\" and \"copyin\" kernel API calls.",
      "cpe_name": "cpe:2.3:a:obdev:little_snitch:3.6.1:*:*:*:*:*:*:*"
    }
  ]
}