{
  "app_name": "Middle",
  "last_updated": "2025-05-05",
  "vulnerabilities": [
    {
      "cve_id": "CVE-2022-3145",
      "published_date": "2023-01-12",
      "last_modified_date": "2025-04-08",
      "base_score": 4.7,
      "severity": "MEDIUM",
      "description": "An open redirect vulnerability exists in Okta OIDC Middleware prior to version 5.0.0 allowing an attacker to redirect a user to an arbitrary URL.",
      "cpe_name": "cpe:2.3:a:okta:oidc_middleware:-:*:*:*:*:node.js:*:*"
    },
    {
      "cve_id": "CVE-2022-23302",
      "published_date": "2022-01-18",
      "last_modified_date": "2024-11-21",
      "base_score": 8.8,
      "severity": "HIGH",
      "description": "JMSSink in all versions of Log4j 1.x is vulnerable to deserialization of untrusted data when the attacker has write access to the Log4j configuration or if the configuration references an LDAP service the attacker has access to. The attacker can provide a TopicConnectionFactoryBindingName configuration causing JMSSink to perform JNDI requests that result in remote code execution in a similar fashion to CVE-2021-4104. Note this issue only affects Log4j 1.x when specifically configured to use JMSSink, which is not the default. Apache Log4j 1.2 reached end of life in August 2015. Users should upgrade to Log4j 2 as it addresses numerous other issues from the previous versions.",
      "cpe_name": "cpe:2.3:a:oracle:middleware_common_libraries_and_tools:12.2.1.4.0:*:*:*:*:*:*:*"
    },
    {
      "cve_id": "CVE-2022-23305",
      "published_date": "2022-01-18",
      "last_modified_date": "2024-11-21",
      "base_score": 9.8,
      "severity": "CRITICAL",
      "description": "By design, the JDBCAppender in Log4j 1.2.x accepts an SQL statement as a configuration parameter where the values to be inserted are converters from PatternLayout. The message converter, %m, is likely to always be included. This allows attackers to manipulate the SQL by entering crafted strings into input fields or headers of an application that are logged allowing unintended SQL queries to be executed. Note this issue only affects Log4j 1.x when specifically configured to use the JDBCAppender, which is not the default. Beginning in version 2.0-beta8, the JDBCAppender was re-introduced with proper support for parameterized SQL queries and further customization over the columns written to in logs. Apache Log4j 1.2 reached end of life in August 2015. Users should upgrade to Log4j 2 as it addresses numerous other issues from the previous versions.",
      "cpe_name": "cpe:2.3:a:oracle:middleware_common_libraries_and_tools:12.2.1.4.0:*:*:*:*:*:*:*"
    },
    {
      "cve_id": "CVE-2022-23307",
      "published_date": "2022-01-18",
      "last_modified_date": "2024-11-21",
      "base_score": 8.8,
      "severity": "HIGH",
      "description": "CVE-2020-9493 identified a deserialization issue that was present in Apache Chainsaw. Prior to Chainsaw V2.0 Chainsaw was a component of Apache Log4j 1.2.x where the same issue exists.",
      "cpe_name": "cpe:2.3:a:oracle:middleware_common_libraries_and_tools:12.2.1.4.0:*:*:*:*:*:*:*"
    },
    {
      "cve_id": "CVE-2021-42575",
      "published_date": "2021-10-18",
      "last_modified_date": "2024-11-21",
      "base_score": 9.8,
      "severity": "CRITICAL",
      "description": "The OWASP Java HTML Sanitizer before 20211018.1 does not properly enforce policies associated with the SELECT, STYLE, and OPTION elements.",
      "cpe_name": "cpe:2.3:a:oracle:middleware_common_libraries_and_tools:12.2.1.4.0:*:*:*:*:*:*:*"
    }
  ]
}