{
  "app_name": "Obsidian",
  "last_updated": "2025-05-03",
  "vulnerabilities": [
    {
      "cve_id": "CVE-2023-0829",
      "published_date": "2023-09-20",
      "last_modified_date": "2024-11-21",
      "base_score": 8.8,
      "severity": "HIGH",
      "description": "Plesk 17.0 through 18.0.31 version, is vulnerable to a Cross-Site Scripting. A malicious subscription owner (either a customer or an additional user), can fully compromise the server if an administrator visits a certain page in Plesk related to the malicious subscription.",
      "cpe_name": "cpe:2.3:a:plesk:plesk:18.0.28:-:*:*:*:*:*:*"
    },
    {
      "cve_id": "CVE-2023-2110",
      "published_date": "2023-08-19",
      "last_modified_date": "2024-11-21",
      "base_score": 8.2,
      "severity": "HIGH",
      "description": "Improper path handling in Obsidian desktop before 1.2.8 on Windows, Linux and macOS allows a crafted webpage to access local files and exfiltrate them to remote web servers via \"app://local/<absolute-path>\". This vulnerability can be exploited if a user opens a malicious markdown file in Obsidian, or copies text from a malicious webpage and paste it into Obsidian.",
      "cpe_name": "cpe:2.3:a:obsidian:obsidian:1.1.9:*:*:*:*:*:*:*"
    },
    {
      "cve_id": "CVE-2023-33244",
      "published_date": "2023-05-20",
      "last_modified_date": "2025-01-31",
      "base_score": 8.2,
      "severity": "HIGH",
      "description": "Obsidian before 1.2.2 allows calls to unintended APIs (for microphone access, camera access, and desktop notification) via an embedded web page.",
      "cpe_name": "cpe:2.3:a:obsidian:obsidian:1.1.9:*:*:*:*:*:*:*"
    },
    {
      "cve_id": "CVE-2023-27035",
      "published_date": "2023-05-01",
      "last_modified_date": "2025-01-30",
      "base_score": 6.5,
      "severity": "MEDIUM",
      "description": "An issue discovered in Obsidian Canvas 1.1.9 allows remote attackers to send desktop notifications, record user audio and other unspecified impacts via embedded website on the canvas page.",
      "cpe_name": "cpe:2.3:a:obsidian:obsidian:1.1.9:*:*:*:*:*:*:*"
    },
    {
      "cve_id": "CVE-2023-24044",
      "published_date": "2023-01-22",
      "last_modified_date": "2025-04-02",
      "base_score": 6.1,
      "severity": "MEDIUM",
      "description": "A Host Header Injection issue on the Login page of Plesk Obsidian through 18.0.49 allows attackers to redirect users to malicious websites via a Host request header. NOTE: the vendor's position is \"the ability to use arbitrary domain names to access the panel is an intended feature.\"",
      "cpe_name": "cpe:2.3:a:plesk:obsidian:-:*:*:*:*:*:*:*"
    }
  ]
}