{
  "app_name": "Opera",
  "last_updated": "2025-05-25",
  "vulnerabilities": [
    {
      "cve_id": "CVE-2020-6159",
      "published_date": "2020-12-23",
      "last_modified_date": "2024-11-21",
      "base_score": 6.1,
      "severity": "MEDIUM",
      "description": "URLs using “javascript:” have the protocol removed when pasted into the address bar to protect users from cross-site scripting (XSS) attacks, but in certain circumstances this removal was not performed. This could allow users to be socially engineered to run an XSS attack against themselves. This vulnerability affects Opera for Android versions below 61.0.3076.56532.",
      "cpe_name": "cpe:2.3:a:opera:opera:52.1.2517.139570:*:*:*:*:android:*:*"
    },
    {
      "cve_id": "CVE-2019-12278",
      "published_date": "2020-03-12",
      "last_modified_date": "2024-11-21",
      "base_score": 4.3,
      "severity": "MEDIUM",
      "description": "Opera through 53 on Android allows Address Bar Spoofing. Characters from several languages are displayed in Right-to-Left order, due to mishandling of several Unicode characters. The rendering mechanism, in conjunction with the \"first strong character\" concept, may improperly operate on a numerical IP address or an alphabetic string, leading to a spoofed URL.",
      "cpe_name": "cpe:2.3:a:opera:opera:52.1.2517.139570:*:*:*:*:android:*:*"
    },
    {
      "cve_id": "CVE-2019-19788",
      "published_date": "2019-12-18",
      "last_modified_date": "2024-11-21",
      "base_score": 5.5,
      "severity": "MEDIUM",
      "description": "Opera for Android before 54.0.2669.49432 is vulnerable to a sandboxed cross-origin iframe bypass attack. By using a service working inside a sandboxed iframe it is possible to bypass the normal sandboxing attributes. This allows an attacker to make forced redirections without any user interaction from a third-party context.",
      "cpe_name": "cpe:2.3:a:opera:opera:52.1.2517.139570:*:*:*:*:android:*:*"
    },
    {
      "cve_id": "CVE-2016-7152",
      "published_date": "2016-09-06",
      "last_modified_date": "2025-04-12",
      "base_score": 5.3,
      "severity": "MEDIUM",
      "description": "The HTTPS protocol does not consider the role of the TCP congestion window in providing information about content length, which makes it easier for remote attackers to obtain cleartext data by leveraging a web-browser configuration in which third-party cookies are sent, aka a \"HEIST\" attack.",
      "cpe_name": "cpe:2.3:a:opera:opera:-:*:*:*:*:android:*:*"
    },
    {
      "cve_id": "CVE-2010-5227",
      "published_date": "2012-09-07",
      "last_modified_date": "2025-04-11",
      "base_score": 6.9,
      "severity": "MEDIUM",
      "description": "Untrusted search path vulnerability in Opera before 10.62 allows local users to gain privileges via a Trojan horse dwmapi.dll file in the current working directory, as demonstrated by a directory that contains a .htm, .mht, .mhtml, .xht, .xhtm, or .xhtl file.  NOTE: some of these details are obtained from third party information.",
      "cpe_name": "cpe:2.3:a:opera:opera:-:*:*:*:*:android:*:*"
    }
  ]
}