{
  "app_name": "Parallels Desktop",
  "last_updated": "2025-05-03",
  "vulnerabilities": [
    {
      "cve_id": "CVE-2024-6240",
      "published_date": "2024-06-21",
      "last_modified_date": "2024-11-21",
      "base_score": 7.7,
      "severity": "HIGH",
      "description": "Improper privilege management vulnerability in Parallels Desktop Software, which affects versions earlier than 19.3.0. An attacker could add malicious code in a script and populate the BASH_ENV environment variable with the path to the malicious script, executing on application startup. An attacker could exploit this vulnerability to escalate privileges on the system.",
      "cpe_name": "cpe:2.3:a:parallels:parallels_desktop:16.5.1:*:*:*:*:macos:*:*"
    },
    {
      "cve_id": "CVE-2024-6154",
      "published_date": "2024-06-20",
      "last_modified_date": "2024-11-21",
      "base_score": 6.7,
      "severity": "MEDIUM",
      "description": "Parallels Desktop Toolgate Heap-based Buffer Overflow Local Privilege Escalation Vulnerability. This vulnerability allows local attackers to escalate privileges on affected installations of Parallels Desktop. An attacker must first obtain the ability to execute high-privileged code on the target guest system in order to exploit this vulnerability.\n\nThe specific flaw exists within the Toolgate component. The issue results from the lack of proper validation of the length of user-supplied data prior to copying it to a fixed-length heap-based buffer. An attacker can leverage this vulnerability to escalate privileges and execute arbitrary code in the context of the current user on the host system. Was ZDI-CAN-20450.",
      "cpe_name": "cpe:2.3:a:parallels:parallels_desktop:16.5.1:*:*:*:*:macos:*:*"
    },
    {
      "cve_id": "CVE-2024-6153",
      "published_date": "2024-06-20",
      "last_modified_date": "2024-11-21",
      "base_score": 7.8,
      "severity": "HIGH",
      "description": "Parallels Desktop Updater Protection Mechanism Failure Software Downgrade Vulnerability. This vulnerability allows local attackers to downgrade Parallels software on affected installations of Parallels Desktop. An attacker must first obtain the ability to execute low-privileged code on the target host system in order to exploit this vulnerability.\n\nThe specific flaw exists within the Updater service. The issue results from the lack of proper validation of version information before performing an update. An attacker can leverage this in conjunction with other vulnerabilities to escalate privileges and execute arbitrary code in the context of root. Was ZDI-CAN-19481.",
      "cpe_name": "cpe:2.3:a:parallels:parallels_desktop:16.5.1:*:*:*:*:macos:*:*"
    },
    {
      "cve_id": "CVE-2022-34891",
      "published_date": "2022-07-18",
      "last_modified_date": "2024-11-21",
      "base_score": 7.8,
      "severity": "HIGH",
      "description": "This vulnerability allows local attackers to escalate privileges on affected installations of Parallels Desktop Parallels Desktop 17.1.1. An attacker must first obtain the ability to execute low-privileged code on the target system in order to exploit this vulnerability. The specific flaw exists within the update machanism. The product sets incorrect permissions on sensitive files. An attacker can leverage this vulnerability to escalate privileges and execute arbitrary code in the context of root. Was ZDI-CAN-16395.",
      "cpe_name": "cpe:2.3:a:parallels:parallels_desktop:17.1.1:*:*:*:*:*:*:*"
    },
    {
      "cve_id": "CVE-2022-34892",
      "published_date": "2022-07-18",
      "last_modified_date": "2024-11-21",
      "base_score": 7.8,
      "severity": "HIGH",
      "description": "This vulnerability allows local attackers to escalate privileges on affected installations of Parallels Desktop Parallels Desktop 17.1.1. An attacker must first obtain the ability to execute low-privileged code on the target system in order to exploit this vulnerability. The specific flaw exists within the update machanism. The issue results from the lack of proper locking when performing operations on an object. An attacker can leverage this vulnerability to escalate privileges and execute arbitrary code in the context of root. Was ZDI-CAN-16396.",
      "cpe_name": "cpe:2.3:a:parallels:parallels_desktop:17.1.1:*:*:*:*:*:*:*"
    }
  ]
}