{
  "app_name": "Signal",
  "last_updated": "2025-05-11",
  "vulnerabilities": [
    {
      "cve_id": "CVE-2023-4830",
      "published_date": "2023-09-15",
      "last_modified_date": "2024-11-21",
      "base_score": 9.8,
      "severity": "CRITICAL",
      "description": "Improper Neutralization of Special Elements used in an SQL Command ('SQL Injection') vulnerability in Tura Signalix allows SQL Injection.This issue affects Signalix: 7T_0228.\n\n",
      "cpe_name": "cpe:2.3:a:turaconsulting:signalix:7t_0228:*:*:*:*:*:*:*"
    },
    {
      "cve_id": "CVE-2023-24069",
      "published_date": "2023-01-23",
      "last_modified_date": "2024-11-21",
      "base_score": 3.3,
      "severity": "LOW",
      "description": "Signal Desktop before 6.2.0 on Windows, Linux, and macOS allows an attacker to obtain potentially sensitive attachments sent in messages from the attachments.noindex directory. Cached attachments are not effectively cleared. In some cases, even after a self-initiated file deletion, an attacker can still recover the file if it was previously replied to in a conversation. (Local filesystem access is needed by the attacker.) NOTE: the vendor disputes the relevance of this finding because the product is not intended to protect against adversaries with this degree of local access.",
      "cpe_name": "cpe:2.3:a:signal:signal-desktop:6.2.0:*:*:*:*:*:*:*"
    },
    {
      "cve_id": "CVE-2023-24068",
      "published_date": "2023-01-23",
      "last_modified_date": "2024-11-21",
      "base_score": 7.8,
      "severity": "HIGH",
      "description": "Signal Desktop before 6.2.0 on Windows, Linux, and macOS allows an attacker to modify conversation attachments within the attachments.noindex directory. Client mechanisms fail to validate modifications of existing cached files, resulting in an attacker's ability to insert malicious code into pre-existing attachments or replace them completely. A threat actor can forward the existing attachment in the corresponding conversation to external groups, and the name and size of the file will not change, allowing the malware to masquerade as another file. NOTE: the vendor disputes the relevance of this finding because the product is not intended to protect against adversaries with this degree of local access.",
      "cpe_name": "cpe:2.3:a:signal:signal-desktop:6.2.0:*:*:*:*:*:*:*"
    }
  ]
}