{
  "app_name": "TigerVNC",
  "last_updated": "2025-05-04",
  "vulnerabilities": [
    {
      "cve_id": "CVE-2024-0408",
      "published_date": "2024-01-18",
      "last_modified_date": "2024-11-21",
      "base_score": 5.5,
      "severity": "MEDIUM",
      "description": "A flaw was found in the X.Org server. The GLX PBuffer code does not call the XACE hook when creating the buffer, leaving it unlabeled. When the client issues another request to access that resource (as with a GetGeometry) or when it creates another resource that needs to access that buffer, such as a GC, the XSELINUX code will try to use an object that was never labeled and crash because the SID is NULL.",
      "cpe_name": "cpe:2.3:a:tigervnc:tigervnc:1.11.0:*:*:*:*:*:*:*"
    },
    {
      "cve_id": "CVE-2024-0409",
      "published_date": "2024-01-18",
      "last_modified_date": "2024-11-21",
      "base_score": 7.8,
      "severity": "HIGH",
      "description": "A flaw was found in the X.Org server. The cursor code in both Xephyr and Xwayland uses the wrong type of private at creation. It uses the cursor bits type with the cursor as private, and when initiating the cursor, that overwrites the XSELINUX context.",
      "cpe_name": "cpe:2.3:a:tigervnc:tigervnc:1.11.0:*:*:*:*:*:*:*"
    },
    {
      "cve_id": "CVE-2020-26117",
      "published_date": "2020-09-27",
      "last_modified_date": "2024-11-21",
      "base_score": 8.1,
      "severity": "HIGH",
      "description": "In rfb/CSecurityTLS.cxx and rfb/CSecurityTLS.java in TigerVNC before 1.11.0, viewers mishandle TLS certificate exceptions. They store the certificates as authorities, meaning that the owner of a certificate could impersonate any server after a client had added an exception.",
      "cpe_name": "cpe:2.3:a:tigervnc:tigervnc:1.10.0:*:*:*:*:*:*:*"
    },
    {
      "cve_id": "CVE-2019-15695",
      "published_date": "2019-12-26",
      "last_modified_date": "2024-11-21",
      "base_score": 7.2,
      "severity": "HIGH",
      "description": "TigerVNC version prior to 1.10.1 is vulnerable to stack buffer overflow, which could be triggered from CMsgReader::readSetCursor. This vulnerability occurs due to insufficient sanitization of PixelFormat. Since remote attacker can choose offset from start of the buffer to start writing his values, exploitation of this vulnerability could potentially result into remote code execution. This attack appear to be exploitable via network connectivity.",
      "cpe_name": "cpe:2.3:a:tigervnc:tigervnc:1.10.0:*:*:*:*:*:*:*"
    },
    {
      "cve_id": "CVE-2019-15691",
      "published_date": "2019-12-26",
      "last_modified_date": "2024-11-21",
      "base_score": 7.2,
      "severity": "HIGH",
      "description": "TigerVNC version prior to 1.10.1 is vulnerable to stack use-after-return, which occurs due to incorrect usage of stack memory in ZRLEDecoder. If decoding routine would throw an exception, ZRLEDecoder may try to access stack variable, which has been already freed during the process of stack unwinding. Exploitation of this vulnerability could potentially result into remote code execution. This attack appear to be exploitable via network connectivity.",
      "cpe_name": "cpe:2.3:a:tigervnc:tigervnc:1.10.0:*:*:*:*:*:*:*"
    }
  ]
}