{
  "app_name": "Webex Teams",
  "last_updated": "2025-05-05",
  "vulnerabilities": [
    {
      "cve_id": "CVE-2022-20863",
      "published_date": "2022-09-08",
      "last_modified_date": "2024-11-21",
      "base_score": 4.3,
      "severity": "MEDIUM",
      "description": "A vulnerability in the messaging interface of Cisco Webex App, formerly Webex Teams, could allow an unauthenticated, remote attacker to manipulate links or other content within the messaging interface. This vulnerability exists because the affected software does not properly handle character rendering. An attacker could exploit this vulnerability by sending messages within the application interface. A successful exploit could allow the attacker to modify the display of links or other content within the interface, potentially allowing the attacker to conduct phishing or spoofing attacks.",
      "cpe_name": "cpe:2.3:a:cisco:webex_teams:40.12.0.17293:*:*:*:*:*:*:*"
    },
    {
      "cve_id": "CVE-2021-1242",
      "published_date": "2021-01-13",
      "last_modified_date": "2024-11-21",
      "base_score": 4.3,
      "severity": "MEDIUM",
      "description": "A vulnerability in Cisco Webex Teams could allow an unauthenticated, remote attacker to manipulate file names within the messaging interface. The vulnerability exists because the affected software mishandles character rendering. An attacker could exploit this vulnerability by sharing a file within the application interface. A successful exploit could allow the attacker to modify how the shared file name displays within the interface, which could allow the attacker to conduct phishing or spoofing attacks.",
      "cpe_name": "cpe:2.3:a:cisco:webex_teams:3.0.15036.0:*:*:*:*:windows:*:*"
    },
    {
      "cve_id": "CVE-2020-3535",
      "published_date": "2020-10-08",
      "last_modified_date": "2024-11-21",
      "base_score": 7.8,
      "severity": "HIGH",
      "description": "A vulnerability in the loading mechanism of specific DLLs in the Cisco Webex Teams client for Windows could allow an authenticated, local attacker to load a malicious library. To exploit this vulnerability, the attacker needs valid credentials on the Windows system. The vulnerability is due to incorrect handling of directory paths at run time. An attacker could exploit this vulnerability by placing a malicious DLL file in a specific location on the targeted system. This file will execute when the vulnerable application launches. A successful exploit could allow the attacker to execute arbitrary code on the targeted system with the privileges of another user&rsquo;s account.",
      "cpe_name": "cpe:2.3:a:cisco:webex_teams:3.0.15036.0:*:*:*:*:windows:*:*"
    },
    {
      "cve_id": "CVE-2020-3541",
      "published_date": "2020-09-04",
      "last_modified_date": "2024-11-21",
      "base_score": 4.4,
      "severity": "MEDIUM",
      "description": "A vulnerability in the media engine component of Cisco Webex Meetings Client for Windows, Cisco Webex Meetings Desktop App for Windows, and Cisco Webex Teams for Windows could allow an authenticated, local attacker to gain access to sensitive information. The vulnerability is due to unsafe logging of authentication requests by the affected software. An attacker could exploit this vulnerability by reading log files that are stored in the application directory. A successful exploit could allow the attacker to gain access to sensitive information, which could be used in further attacks.",
      "cpe_name": "cpe:2.3:a:cisco:webex_teams:3.0.15036.0:*:*:*:*:windows:*:*"
    },
    {
      "cve_id": "CVE-2020-3155",
      "published_date": "2020-03-04",
      "last_modified_date": "2024-11-21",
      "base_score": 7.4,
      "severity": "HIGH",
      "description": "A vulnerability in the SSL implementation of the Cisco Intelligent Proximity solution could allow an unauthenticated, remote attacker to view or alter information shared on Cisco Webex video devices and Cisco collaboration endpoints if the products meet the conditions described in the Vulnerable Products section. The vulnerability is due to a lack of validation of the SSL server certificate received when establishing a connection to a Cisco Webex video device or a Cisco collaboration endpoint. An attacker could exploit this vulnerability by using man in the middle (MITM) techniques to intercept the traffic between the affected client and an endpoint, and then using a forged certificate to impersonate the endpoint. Depending on the configuration of the endpoint, an exploit could allow the attacker to view presentation content shared on it, modify any content being presented by the victim, or have access to call controls. This vulnerability does not affect cloud registered collaboration endpoints.",
      "cpe_name": "cpe:2.3:a:cisco:webex_teams:42.7:*:*:*:*:*:*:*"
    }
  ]
}